<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"28477f567d907e65c9738372c61937d2d9f010e1faaafce442a458fae990c69d","plan_job_ref":"Job Run Terraform plan in staging #160 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12792186269","plan_out_hash":"cf05324dabe4859b8e126d46ab5ec0af633dc4dc87b6e94441344fc9c772d972","plan_hash":"6211a7f872331766a53ce978b00fbb19d9ff8951e0aec87ea6d528d32e51d146","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 2 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
-       command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server" -> null
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
-       health_check_http_endpoint  = "/up" -> null
!~      health_check_type           = "http" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      instances                   = 1 -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
!~      memory                      = "256M" -> (known after apply)
        name                        = "continuous_monitoring-staging"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_http_endpoint  = "/up"
+               health_check_type           = "http"
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
!~      readiness_health_check_type = "process" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-14T21:12:00Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.app_space.cloudfoundry_security_group_space_bindings.security_group_bindings["trusted_local_networks_egress"] will be created
+   resource "cloudfoundry_security_group_space_bindings" "security_group_bindings" {
+       running_spaces = [
+           "9893e955-a23b-4b37-a898-df5b3b73b9de",
        ]
+       security_group = "71d5aa70-fdce-46fa-8494-aabdb8cae381"
    }

  # module.database.data.cloudfoundry_service_plans.rds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "rds" {
+       name                  = "micro-psql"
+       service_offering_name = "aws-rds"
+       service_plans         = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be updated in-place
!~  resource "cloudfoundry_service_instance" "rds" {
+       dashboard_url     = (known after apply)
        id                = "e304aaca-938d-4955-92c0-3013ba4196f4"
!~      last_operation    = {
!~          created_at  = "2024-12-26T21:38:45Z" -> (known after apply)
!~          description = "The service instance status is succeeded" -> (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "create" -> (known after apply)
!~          updated_at  = "2024-12-26T21:38:45Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "continuous_monitoring-rds-staging"
!~      service_plan      = "5ed9f319-4c75-4851-9885-598a96b7febc" -> (known after apply)
        tags              = [
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2024-12-26T21:32:43Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.egress_proxy.data.external.proxyzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "proxyzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-proxy.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy"
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      path                        = "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy/proxy.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "e7c0c851594335804de4a0ef9987f14e28f037eff12f69ae058fad0b0b54ae86" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-03T15:01:55Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.egress_space.cloudfoundry_security_group_space_bindings.security_group_bindings["public_networks_egress"] will be created
+   resource "cloudfoundry_security_group_space_bindings" "security_group_bindings" {
+       running_spaces = [
+           "aaf1b82f-9fe4-4df6-b431-b8bd631ded52",
        ]
+       security_group = "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22"
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #160](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12792186269)